import 'package:flutter/material.dart';
import 'package:islamic/models/GodName.dart';
import 'models/DouaMorning_Evening.dart';

List<GodName> names = [
  GodName("اللَّهُ",
      "وهو الاسم الأعظم الذي تفرد به الحق سبحانه وخص به نفسه وجعله أول أسمائه، وأضافها كلها إليه فهو علم على ذاته سبحانه"),
  GodName("الرَّحْمَنُ",
      "كثير الرحمة وهو اسم مقصور على الله عز وجل ولا يجوز أن يقال رحمن لغير الله، وذلك لأن رحمته وسعت كل شيء وهو أرحم الراحمين"),
  GodName("الرَّحِيمُ", "هو المنعم أبدا، المتفضل دوما، فرحمته لا تنتهي"),
  GodName("المَلِكُ",
      "هو الله، ملك الملوك، له الملك، وهو مالك يوم الدين، ومليك الخلق فهو المالك المطلق"),
  GodName(
      "القُدُّوسُ", "هو الطاهر المنزه عن العيوب والنقائص وعن كل ما تحيط به العقول"),
  GodName("السَّلَامُ",
      "هو ناشر السلام بين الأنام وهو الذي سلمت ذاته من النقص والعيب والفناء"),
  GodName("المُؤْمِنُ", "هو الذي سلم أوليائه من عذابه، والذي يصدق عباده ما وعدهم"),
  GodName("المُهَيْمِنُ",
      "هو الرقيب الحافظ لكل شيء، القائم على خلقه بأعمالهم، وأرزاقهم وآجالهم، المسؤول عنهم بالرعاية والوقاية والصيانة"),
  GodName("العَزِيزُ",
      "هو المنفرد بالعزة، الظاهر الذي لا يقهر، القوي الممتنع فلا يغلبه شيء وهو غالب كل شيء"),
  GodName("الجَبَّارُ",
      " هو الذي تنفذ مشيئته، ولا يخرج أحد عن تقديره، وهو القاهر لخلقه على ما أراد"),
  GodName("المُتَكَبِّرُ", " هو المتعالى عن صفات الخلق المنفرد بالعظمة والكبرياء"),
  GodName("الخَالِقُ",
      "هو الفاطر المبدع لكل شيء، والمقدر له والموجد للأشياء من العدم، فهو خالق كل صانع وصنعته"),
  GodName("البَارِىءُ",
      "هو الذي خلق الخلق بقدرته لا عن مثال سابق، القادر على إبراز ما قدره إلى الوجود"),
  GodName("المُصَوِّرُ",
      "هو الذي صور جميع الموجودات، ورتبها فأعطى كل شيء منها صورة خاصة، وهيئة منفردة، يتميز بها على اختلافها "),
  GodName("الغَفَّارُ", "هو وحده الذي يغفر الذنوب ويستر العيوب في الدنيا والآخرة"),
  GodName("القَهَّارُ",
      "هو الغالب الذي قهر خلقه بسلطانه وقدرته، وصرفهم على ما أراد طوعا وكرها، وخضع لجلاله كل شيء"),
  GodName("الوَهَّابُ",
      "هو المنعم على العباد، الذي يهب بغير عوض ويعطي الحاجة بغير سؤال، كثير النعم، دائم العطاء"),
  GodName("الرَّزَّاقُ",
      "هو الذي خلق الأرزاق وأعطى كل الخلائق أرزاقها، ويمد كل كائن لما يحتاجه، ويحفظ عليه حياته ويصلحه"),
  GodName("الرَّزَّاقُ",
      "هو الذي يفتح مغلق الأمور، ويسهل العسير، وبيده مفاتيح السماوات والأرض"),
  GodName("العَلِيمُ",
      "هو الذي يعلم تفاصيل الأمور، ودقائق الأشياء وخفايا الضمائر، والنفوس، لا يغرب عن ملكه مثقال ذرة، فعلمه يحيط بجميع الأشياء"),
  GodName("القَابِضُ",
      "هو الذي يقبض الرزق عمن يشاء من الخلق بعدله، والذي يوسع الرزق لمن يشاء من عباده بجوده ورحمته فهو سبحانه القابض الباسط"),
  GodName("البَاسِطُ",
      "هو الذي يقبض الرزق عمن يشاء من الخلق بعدله، والذي يوسع الرزق لمن يشاء من عباده بجوده ورحمته فهو سبحانه القابض الباسط"),
  GodName("الخَافِضُ",
      "هو الذي يخفض الأذلال لكل من طغى وتجبر وخرج على شريعته وتمرد، وهو الذي يرفع عباده المؤمنين بالطاعات وهو رافع السماوات"),
  GodName("الرَّافِعُ",
      "هو الذي يخفض الأذلال لكل من طغى وتجبر وخرج على شريعته وتمرد، وهو الذي يرفع عباده المؤمنين بالطاعات وهو رافع السماوات"),
  GodName("المُعِزُّ",
      "هو الذي يهب القوة والغلبة والشدة لمن شاء فيعزه، وينزعها عمن يشاء فيذله"),
  GodName("المُذِلُّ",
      "هو الذي يهب القوة والغلبة والشدة لمن شاء فيعزه، وينزعها عمن يشاء فيذله"),
  GodName("السَّمِيعُ",
      "هو الذي لا يخفى عليه شيء في الأرض ولا في السماء وهو السميع البصير"),
  GodName("البَصِيرُ",
      "هو الذي يرى الأشياء كلها ظاهرها وباطنها وهو المحيط بكل شيئ علماً"),
  GodName("الحَكَمُ",
      "هو الذي يفصل بين مخلوقاته بما شاء ويفصل بين الحق والباطل لا راد لقضائه ولا معقب لحكمه"),
  GodName("العَدْلُ",
      "هو الذي حرم الظلم على نفسه، وجعله على عباده محرما، فهو المنزه عن الظلم والجور في أحكامه وأفعاله الذي يعطي كل ذي حق حقه"),
  GodName("اللَّطِيفُ",
      "هو البر الرفيق بعباده، يرزق وييسر ويحسن إليهم، ويرفق بهم ويتفضل عليهم"),
  GodName("الخَبِيرُ",
      "هو العليم بدقائق الأمور، لا تخفى عليه خافية، ولا يغيب عن علمه شيء فهو العالم بما كان ويكون"),
  GodName("الحَلِيمُ",
      "هو الصبور الذي يمهل ولا يهمل، ويستر الذنوب، ويؤخر العقوبة، فيرزق العاصي كما يرزق المطيع"),
  GodName(
      "العَظِيمُ", "هو الذي ليس لعظمته بداية ولا لجلاله نهاية، وليس كمثله شيء"),
  GodName("الغَفُورُ", "هو الساتر لذنوب عباده المتجاوز عن خطاياهم وذنوبهم"),
  GodName("الشَّكُورُ",
      "هو الذي يزكو عنده القليل من أعمال العباد، فيضاعف لهم الجزاء، وشكره لعباده مغفرته لهم"),
  GodName("العَلِيُّ",
      "هو الرفيع القدر فلا يحيط به وصف الواصفين المتعالي عن الأنداد والأضداد، فكل معاني العلو ثابتة له ذاتا وقهرا وشأنا"),
  GodName("الكَبِيرُ",
      "هو العظيم الجليل ذو الكبرياء في صفاته وأفعاله فلا يحتاج إلى شيء ولا يعجزه شيء (ليس كمثله شيء)"),
  GodName("الحَفِيظُ",
      "هو الذي لا يغرب عن حفظه شيء ولو كمثقال الذر فحفظه لا يتبدل ولا يزول ولا يعتريه التبديل"),
  GodName("المُقِيتُ",
      "هو المتكفل بإيصال أقوات الخلق إليهم وهو الحفيظ والمقتدر والقدير والمقدر والممدد"),
  GodName("الحَسِيبُ",
      "هو الكافي الذي منه كفاية العباد وهو الذي عليه الإعتماد يكفي العباد بفضله"),
  GodName("الجَلِيلُ",
      "هو العظيم المطلق المتصف بجميع صفات الكمال والمنعوت بكمالها المنزه عن كل نقص"),
  GodName("الكَرِيمُ",
      "هو الكثير الخير الجواد المعطي الذي لا ينفذ عطاؤه وهو الكريم المطلق الجامع لأنواع الخير والشرف والفضائل المحمود بفعاله"),
  GodName("الرَّقِيبُ",
      " هو الرقيب الذي يراقب أحوال العباد ويعلم أقوالهم ويحصي أعمالهم وهو الحافظ الذي لا يغيب عنه شيء"),
  GodName("المُجِيبُ",
      "هو الذي يجيب دعاء من دعاه، وسؤال من سأله، ويقابله بالعطاء والقبول، ولا يسأل أحد سواه"),
  GodName("الوَاسِعُ",
      "هو الذي وسع رزقه جميع خلقه، وسعت رحمته كل شيء المحيط بكل شيء"),
  GodName("الحَكِيمُ",
      "هو المحق في تدبيره اللطيف في تقديره الخبير بحقائق الأمور العليم بحكمه المقدور فجميع خلقه وقضاه خير وحكمة وعدل"),
  GodName("الوَدُودُ", "هو المحب لعباده، والمحبوب في قلوب أوليائه"),
  GodName("المَجِيدُ",
      "هو البالغ النهاية في المجد، الكثير الإحسان الجزيل العطاء العظيم البر"),
  GodName("البَاعِثُ",
      "هو باعث الخلق يوم القيامة، وباعث رسله إلى العباد، وباعث المعونة إلى العبد"),
  GodName("الشَّهِيدُ",
      "هو الحاضر الذي لا يغيب عنه شيء، فهو المطلع على كل شيء مشاهد له عليم بتفاصيله"),
  GodName(
      "الحَقُّ", "هو الذي يحق الحق بكلماته ويؤيد أولياءه فهو المستحق للعبادة"),
  GodName("الوَكِيلُ",
      "هو الكفيل بالخلق القائم بأمورهم فمن توكل عليه تولاه وكفاه، ومن استغنى به أغناه وأرضاه"),
  GodName("القَوِيُّ",
      "هو صاحب القدرة التامة البالغة الكمال غالب لا يغلب فقوته فوق كل قوة"),
  GodName("المَتِينُ",
      "هو الشديد الذي لا يحتاج في إمضاء حكمه إلى جند أو مدد ولا إلى معين"),
  GodName("الوَلِيُّ",
      "هو المحب الناصر لمن أطاعه، ينصر أولياءه، ويقهر أعداءه، والمتولي الأمور الخلائق ويحفظهم"),
  GodName("الحَمِيدُ", "هو المستحق للحمد والثناء، الذي لا يحمد على مكروه سواه"),
  GodName("المُحْصِي", "هو الذي أحصى كل شيء بعلمه، فلا يفوته منها دقيق ولا جليل"),
  GodName("المُبْدِىءُ", "هو الذي أنشأ الأشياء، واخترعها ابتداء من غير سابق مثال"),
  GodName("المُعِيدُ",
      "هو الذي يعيد الخلق بعد الحياة إلى الممات في الدنيا، وبعد الممات إلى الحياة يوم القيامة"),
  GodName("المُحْيِي",
      "هو خالق الحياة ومعطيها لمن شاء، يحيي الخلق من العدم ثم يحييهم بعد الموت"),
  GodName("المُمِيتُ",
      "هو مقدر الموت على كل من أماته ولا مميت سواه، قهر عباده بالموت متى شاء وكيف شاء"),
  GodName("الحَيُّ",
      "هو المتصف بالحياة الأبدية التي لا بداية لها ولا نهاية فهو الباقي أزلا وأبدا وهو الحي الذي لا يموت"),
  GodName("القَيُّومُ",
      "هو القائم بنفسه، الغني عن غيره، وهو القائم بتدبير أمر خلقه في إنشائهم ورزقهم"),
  GodName("الوَاجِدُ",
      "هو الذي لا يعوزه شيء ولا يعجزه شيء يجد كل ما يطلبه، ويدرك كل ما يريده"),
  GodName("المَاجِدُ",
      "هو الذي له الكمال المتناهي والعز الباهي، له العز في الأوصاف والأفعال الذي يعامل العباد بالجود والرحمة"),
  GodName("الوَاحِدُ",
      "هو الفرد المتفرد في ذاته وصفائه وأفعاله، واحد في ملكه لا ينازعه أحد، لا شريك له سبحانه"),
  GodName("الصَّمَدُ",
      "هو المطاع الذي لا يقضى دونه أمر، الذي يقصد إليه في الحوائج فهو مقصد عباده في مهمات دينهم ودنياهم"),
  GodName("القَادِرُ",
      "هو الذي يقدر على إيجاد المعدوم وإعدام الموجود على قدر ما تقتضي الحكمة، لا زائدا عليه ولا ناقصا عنه"),
  GodName(
      "المُقْتَدِرُ", "هو الذي يقدر على إصلاح الخلائق على وجه لا يقدر عليه غيره"),
  GodName("المُقَدِّمُ",
      "هو الذي يقدم الأشياء ويضعها في مواضعها، فمن استحق التقديم قدمه"),
  GodName("المُؤَخِّرُ",
      "هو الذي يؤخر الأشياء فيضعها في مواضعها المؤخر لمن شاء من الفجار والكفار وكل من يستحق التأخير"),
  GodName("الأَوَّلُ", "هو الذي لم يسبقه في الوجود شيء فهو أول قبل الوجود"),
  GodName("الآخِرُ",
      "هو الباقي بعد فناء خلقه، البقاء الأبدي يفنى الكل وله البقاء وحده، فليس بعده شيء"),
  GodName(
      "الظَّاهِرُ", "هو الذي ظهر فوق كل شيء وعلا عليه، الظاهر وجوده لكثرة دلائله"),
  GodName("البَاطِنُ",
      "هو العالم ببواطن الأمور وخفاياها، وهو أقرب إلينا من حبل الوريد"),
  GodName("الوَالِي",
      "هو المالك للأشياء المتصرف فيها بمشيئته وحكمته، ينفذ فيها أمره، ويجري عليها حكمه"),
  GodName("المُتَعَالِ", "هو الذي جل عن إفك المفترين، وتنزه عن وساوس المتحيرين"),
  GodName("البَرُّ",
      "هو العطوف على عباده ببره ولطفه، ومن على السائلين بحسن عطائه، وهو الصدق فيما وعد"),
  GodName("التَّوَّابُ",
      "هو الذي يوفق عباده للتوبة حتى يتوب عليهم ويقبل توبتهم فيقابل الدعاء بالعطاء، والتوبة بغفران الذنوب"),
  GodName("المُنْتَقِمُ",
      "هو الذي يقسم ظهور الطغاة، ويشدد العقوبة على العصاة، وذلك بعد الإعذار والإنذار"),
  GodName("العَفُوُّ",
      "هو الذي يترك المؤاخدة على الذنوب ولا يذكرك بالعيوب فهو يمحو السيئات ويتجاوز عن المعاصي"),
  GodName("الرَّءُوفُ",
      "هو المتعطف على المذنبين بالتوبة، الذي جاد بلطفه ومن بتعطفه، يستر العيوب ثم يعفو عنها"),
  GodName("مَالِكُ المُلْكِ",
      "هو المتصرف في ملكه كيف يشاء لا راد لحكمه، ولا معقب لأمره"),
  GodName("ذُو الجَلَالِ وَالإِكْرَامِ",
      "هو المنفرد بصفات الجلال والكمال والعظمة، المختص بالإكرام والكرامة وهو أهل لأن يجل"),
  GodName("المُقْسِطُ",
      "هو العادل في حكمه، الذي ينتصف للمظلوم من الظالم، ثم يكمل عدله فيرضي الظالم بعد إرضاء المظلوم"),
  GodName("الجَامِعُ",
      "هو الذي جمع الكمالات كلها، ذاتا ووصفا وفعلا، الذي يجمع بين الخلائق المتماثلة والمتباينة، والذي يجمع الأولين والآخرين"),
  GodName("الغَنِيُّ",
      "هو الذي لا يحتاج إلى شيء، وهو المستغني عن كل ما سواه، المفتقر إليه كل من عاداه"),
  GodName("المُغْنِيُّ",
      "هو معطي الغنى لعباده، يغني من يشاء غناه، وهو الكافي لمن شاء من عباده"),
  GodName("المَانِعُ",
      "هو الذي أعطى كل شيء، ويمنع العطاء عن من يشاء ابتلاء أو حماية"),
  GodName("الضَّارُ",
      "هو المقدر للضر على من أراد كيف أراد، والمقدر النفع والخير لمن أراد كيف أراد كل ذلك على مقتضى حكمته سبحانه"),
  GodName("النَّافِعُ",
      "هو المقدر للضر على من أراد كيف أراد، والمقدر النفع والخير لمن أراد كيف أراد كل ذلك على مقتضى حكمته سبحانه"),
  GodName("النُّورُ",
      "هو الهادي الرشيد الذي يرشد بهدايته من يشاء فيبين له الحق، ويلهمه اتباعه، الظاهر في ذاته، المظهر لغيره"),
  GodName("الهَادِي",
      " هو المبين للخلق طريق الحق بكلامه يهدي القلوب إلى معرفته، والنفوس إلى طاعته"),
  GodName("البَدِيعُ",
      "هو الذي لا يماثله أحد في صفاته ولا في حكم من أحكامه، أو أمر من أموره، فهو المحدث الموجد على غير مثال"),
  GodName("البَاقِي",
      "هو وحده له البقاء، الدائم الوجود الموصوف بالبقاء الأزلي، غير قابل للفناء فهو الباقي بلا انتهاء"),
  GodName("الوَارِثُ",
      "هو الأبقى الدائم الذي يرث الخلائق بعد فناء الخلق، وهو يرث الأرض ومن عليها"),
  GodName("الرَّشِيدُ",
      "هو الذي أسعد من شاء بإرشاده، وأشقى من شاء بإبعاده، عظيم الحكمة بالغ الرشاد"),
  GodName("الصَّبُورُ",
      "هو الحليم الذي لا يعاجل العصاة بالنقمة، بل يعفوا ويؤخر، ولا يسرع بالفعل قبل أوانه"),
];
List<Doua> douaMorningList=[
  Doua("أذكار الصباح", Colors.green),
  Doua(
      "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ \n اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ"
          " وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي "
          "الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ"
          " وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ "
          "السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. ",
      Colors.black87,
      "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح ",
      1),
  Doua(
      "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n "
          "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ. ",
      Colors.black87,
      "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)",
      3),
  Doua(
      "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n "
          "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ. ",
      Colors.black87,
      "",
      3),
  Doua(
      "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n "
          "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.",
      Colors.black87,
      "",
      3),
  Doua(
      "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ،"
          " رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، "
          "رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.",
      Colors.black87,
      "",
      1),
  Doua(
      "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ،"
          " خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، "
          "أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .",
      Colors.black87,
      "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح",
      1),
  Doua(
      "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.",
      Colors.black87,
      "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة",
      3),
  Doua(
      "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك"
          " ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
      Colors.black87,
      "من قالها أعتقه الله من النار",
      4),
  Doua(
      "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ "
          "أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
      Colors.black87,
      "من قالها حين يصبح أدى شكر يومه",
      1),
  Doua(
      "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.",
      Colors.black87,
      "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة",
      7),
  Doua(
      "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
      Colors.black87,
      "من قالها لم يضره من الله شيء",
      3),
  Doua(
      "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.",
      Colors.black87,
      "",
      1),
  Doua(
      "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،"
          " وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
      Colors.black87,
      "",
      1),
  Doua(
      "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.",
      Colors.black87,
      "",
      3),
  Doua(
      "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.",
      Colors.black87,
      "",
      3),
  Doua(
      "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.",
      Colors.black87,
      "",
      3),
  Doua(
      "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ،"
          " اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، "
          "اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
      Colors.black87,
      "",
      1),
  Doua(
      "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.",
      Colors.black87,
      "",
      3),
  Doua(
      "أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ،"
          " اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ "
          "، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.",
      Colors.black87,
      "",
      1),
  Doua(
      "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، "
          "أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ "
          "، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.",
      Colors.black87,
      "",
      1),
  Doua(
      "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.",
      Colors.black87,
      "",
      3),
  Doua(
      "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.",
      Colors.black87,
      "قال النبي من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة",
      10),
  Doua(
      "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.",
      Colors.black87,
      "",
      3),
  Doua(
      "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ،"
          " وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.",
      Colors.black87,
      "",
      3),
  Doua(
      "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.",
      Colors.black87,
      "",
      3),
  Doua(
      " يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.",
      Colors.black87,
      "",
      1),
  Doua(
      "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا.",
      Colors.black87,
      "",
      1),
  Doua(
      "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ "
          "، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ "
          "، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ "
          "، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، "
          "وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.",
      Colors.black87,
      "",
      1),
  Doua(
      " لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.",
      Colors.black87,
      "من قالها كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان",
      100),
  Doua(
      " سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
      Colors.black87,
      " من قالها حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ",
      100),
  Doua(
      "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ",
      Colors.black87,
      "من قالها له مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى",
      100),
];
List<Doua> douaEveningList=[
  Doua("أذكار المساء", Colors.green),
  Doua("أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ \n "
      "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ"
      " وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي "
      "الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ"
      " وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ "
      "السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.",
      Colors.black87,
      "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح",
      1),
  Doua("أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ \n "
      "آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَد"
      "ٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا"
      " إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا "
      "وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا"
      " بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ.",
      Colors.black87,
      "من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه",
      1),
  Doua("بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \n "
      "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.",
      Colors.black87,
      "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)",
      3),
  Doua( "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \n "
      "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ "
      "إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.",
      Colors.black87,
      "",
      3),
  Doua("بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم \n "
      "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ "
      "ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، "
      "ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.",
      Colors.black87,
      "",
      3),
  Doua(" أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ"
      " لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ"
      " اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، "
      "رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر. ",
      Colors.black87,
      "",
      1),
  Doua(" اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ "
      "، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ،"
      " أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ"
      " بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ . ",
      Colors.black87,
      "من قالها موقناً بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح",
      1),
  Doua( "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.",
      Colors.black87,
      "من قالها حين يصبح وحين يمسي كان حقا على الله أن يرضيه يوم القيامة",
      3),
  Doua( "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك"
      " ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
      Colors.black87,
      "من قالها أعتقه الله من النار",
      4),
  Doua("اللّهُـمَّ ما أَمسى بي  مِـنْ نِعْـمَةٍ "
      "أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر. ",
      Colors.black87,
      "من قالها حين يمسى أدى شكر يومه",
      1),
  Doua("حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم. ",
      Colors.black87,
      "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة",
      7),
  Doua( "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
      Colors.black87,
      "من قالها لم يضره من الله شيء",
      3),
  Doua( "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ.",
      Colors.black87,
      "",
      1),
  Doua( " أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ،"
      " وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، "
      "وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ. ",
      Colors.black87,
      "",
      1),
  Doua("سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.",
      Colors.black87,
      "",
      3),
  Doua( "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ. ",
      Colors.black87,
      "",
      3),
  Doua("اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.",
      Colors.black87,
      "",
      3),
  Doua(" اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة"
      " ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي "
      "، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ،"
      "اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي "
      "، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي. ",
      Colors.black87,
      "",
      1),
  Doua(
      "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.",
      Colors.black87,
      "",
      3),
  Doua(
      " أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، "
          "اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا،"
          " وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا.  ",
      Colors.black87,
      "",
      3),
  Doua(
      " اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه"
          " ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت "
          "، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ،"
          " وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.  ",
      Colors.black87,
      "",
      3),
  Doua(
      "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق. ",
      Colors.black87,
      "",
      3),
  Doua(
      "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.",
      Colors.black87,
      "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة",
      10),
  Doua(
      "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ. ",
      Colors.black87,
      "",
      3),
  Doua(
      "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ،"
          " وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ. ",
      Colors.black87,
      "",
      3),
  Doua(
      "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.",
      Colors.black87,
      "",
      3),
  Doua(
      " يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ. ",
      Colors.black87,
      "",
      1),
  Doua(
      "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ. ",
      Colors.black87,
      "من قالها كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان",
      100),
  Doua(
      " اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ"
          " , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ "
          "، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ"
          " , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ"
          " ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا"
          ", اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي"
          " ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ،"
          " إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ. ",
      Colors.black87,
      "",
      1),
  Doua(
      "سُبْحـانَ اللهِ وَبِحَمْـدِهِ. ",
      Colors.black87,
      "من قالها مئة مرة حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَة"
          "ِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ",
      100),

];


List<String> data = [
  "سبحان الله",
  "الحمدلله",
  "لا إاله إلا الله ",
  "الله أكبر"
];
List<String> names1 = ["الشهادتان", "الصلاة", "الزكاة", "الصوم", "الحج"];

List<String> names2 = [
  " الإيمان بالله",
  " الإيمان بالملائكة",
  " الإيمان بالكتب السماوية",
  "الإيمان بالأنبياء والرسل",
  "الإيمان باليوم الآخر",
  " الإيمان بالقضاء وبالقدر خيره وشره"
];

List<String> names3 = [
  "آدم عليه السلام",
  "إدريس عليه السلام",
  "نوح عليه السلام",
  "هود عليه السلام",
  "صالح عليه السلام",
  "إبراهيم عليه السلام",
  "شعيب عليه السلام",
  "إسماعيل عليه السلام",
  "إسحاق عليه السلام",
  "يعقوب عليه السلام",
  " يوسف عليه السلام",
  "أيوب عليه السلام",
  "ذو الكفل عليه السلام",
  "يونس عليه السلام",
  "موسى عليه السلام",
  "هارون عليه السلام",
  "يوشع عليه السلام",
  "إلياس عليه السلام",
  "اليسع عليه السلام",
  "داود عليه السلام",
  "سليمان عليه السلام",
  " زكريا عليه السلام",
  "يحيى عليه السلام",
  "عيسى بن مريم عليه الصلاة والسلام",
  "وأخيراً سيد الخلق وخاتم الأنبياء النبي محمد صلى الله عليه وسلم"
];
List<String> names4 = [
  "أبو بَكر الصّدِّيق عبد الله بن أبي قُحافة التَّيمي القُرَشيّ",
  "أبو حفص عمر بن الخطاب العدوي القرشي",
  "أبو عبد الله عثمان بن عفَّان الأموي القرشي",
  "أبو الحسن علي بن أبي طالب الهاشمي القُرشي",
  "الزُّبَيْرُ بن العَوَّام القرشي الأسدي",
  "طَلْحَة بن عُبَيْد اللّه التَّيمي القُرشي",
  "عبد الرّحمن بن عوف القرشيّ الزهريّ",
  "سَعِيد بن زَيْد القرشي العدوي",
  "سَعْد بن أَبي وقاص مَالِك القرشي الزهري",
  "أبو عبيدة عامر بن عبد الله بن الجراح الفهري القرشي",
];
/*

 */
